test/dummy/app/controllers/items_controller.rb

SELECT "items".* FROM "items" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 1]]
---
  def index
    render_ok( items: Item.paginate(per_page, current_page).as_json(:Item) )

INSERT INTO "items" ("code", "name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["code", 2], ["name", "black tshirt"], ["price", 99.9], ["created_at", "2024-02-10 18:17:56.404796"], ["updated_at", "2024-02-10 18:17:56.404796"]]
---
  def create
    render_safe(:item) { Item.create!(item_creation_params).as_json(:Item) }

UPDATE "items" SET "price" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["price", 99.9], ["updated_at", "2024-02-10 18:17:56.367407"], ["id", 1053882409]]
---
  def update
    render_safe(:item) { @item.update!(item_update_params) && @item.as_json(:Item) }

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1053882409]]
---
  def destroy
    @item.destroy

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1007699722], ["LIMIT", 1]]
---
    def set_item
      @item = Item.find_by_id(params[:id])