test/dummy/app/controllers/promotions_controller.rb

SELECT "promotions".* FROM "promotions" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 1]]
---
  def index
    render_ok( promotions: Promotion.paginate(per_page, current_page).as_json(:Promotion) )

INSERT INTO "promotions" ("title", "active", "pattern", "free_stuff", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    render_safe(:promotion) { Promotion.create!(promo_creation_params).as_json(:Promotion) }

UPDATE "promotions" SET "title" = $1, "free_stuff" = $2, "updated_at" = $3 WHERE "promotions"."id" = $4  [["title", "new Promotion"], ["free_stuff", "{tshirt}"], ["updated_at", "2024-02-10 18:17:56.121395"], ["id", 983602829]]
---
  def update
    render_safe(:promotion) { @promotion.update!(promo_creation_params) && @promotion.as_json(:Promotion) }

DELETE FROM "promotions" WHERE "promotions"."id" = $1  [["id", 983602829]]
---
  def destroy
    @promotion.destroy

SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = $1 LIMIT $2  [["id", 1007699722], ["LIMIT", 1]]
---
    def set_promotion
      @promotion = Promotion.find_by_id(params[:id])